aula-08/grupo1/blogpba/app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def create
      @article = Article.find(params[:article_id])