aula-08/grupo2/blog-grupo2/app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["title", "Teste2"], ["updated_at", "2021-09-08 20:48:45.457782"], ["status", "archived"], ["id", 4]]